Revit 2026 API

# ViewAddFilter Method

---

Adds a filter to the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddFilter(
	ElementId filterElementId
)
```
```vb
Public Sub AddFilter (
	filterElementId As ElementId
)
```
```cpp
public:
void AddFilter(
	ElementId^ filterElementId
)
```
```fsharp
member AddFilter :
        filterElementId : ElementId -> unit
```

#### Parameters

filterElementId ElementId
     ElementId of the filter.

| Exception | Condition |
| --- | --- |
| ArgumentException | ElementId is not associated with a FilterElement. -or- Filter is already applied to the view. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes. |

The filter will be added with default overrides, which means that there will be no change in the view's display. The filter is appended as the last filter in the order of filters applied to this view.

#### Reference

View Class

Autodesk.Revit.DB Namespace